#include "hrtos_hal.h"


/*------------------------------------------------
 * 从DS1302读取一个字节
 *
 * addr：DS1302读取命令地址
 *
 * 返回：
 * DS1302读取到的8位数据
 *
 * DS1302采用低位优先方式传输。
 *------------------------------------------------*/
unsigned char drv_ds1302_read_byte(unsigned char addr)
{
    unsigned char i;
    unsigned char _data;
    //unsigned char bit_data;

    unsigned char ea_state;


    _data = 0;


    /* 保存进入函数前的中断状态 */
    ea_state = EA;

    /* 关闭总中断，保护严格时序 */
    EA = 0;


    /*------------------------------------------------
     * 开始一次DS1302通信
     *------------------------------------------------*/
    DS1302_RST = 0;
    _nop_();

    DS1302_SCLK = 0;
    _nop_();

    DS1302_RST = 1;
    _nop_();


    /*------------------------------------------------
     * 发送8位读取地址
     *
     * DS1302低位优先传输。
     *------------------------------------------------*/
    for(i = 0; i < 8; i++)
    {
        DS1302_IO = (bit)(addr & 0x01);

        

        DS1302_SCLK = 1;
        _nop_();

        DS1302_SCLK = 0;
        //_nop_();
		
		addr >>= 1;
    }

/* ★ 释放DS1302双向IO总线 */
//DS1302_IO = 1;
    //_nop_();


    /*------------------------------------------------
     * 读取8位数据
     *
     * DS1302从最低位开始输出。
     *------------------------------------------------*/
    for(i = 0; i < 8; i++)
    {
        DS1302_IO =1 ;
		
		
		_data >>=1;
		if(DS1302_IO)_data |=0x80;
		DS1302_SCLK=1;
		_nop_();
		DS1302_SCLK=0;
		
		
		
    }


    /*------------------------------------------------
     * 结束通信
     *------------------------------------------------*/
    

    DS1302_SCLK = 1;
    _nop_();
	
	DS1302_RST = 0;
    _nop_();

    


    /* 恢复进入函数之前的中断状态 */
    EA = ea_state;


    return _data;
}