#include "hrtos_hal.h"


/*------------------------------------------------
 * 设置DS1302时间
 *
 * time[0]：秒
 * time[1]：分
 * time[2]：时
 * time[3]：日
 * time[4]：月
 * time[5]：星期
 * time[6]：年
 *
 * 数据必须采用BCD格式。
 *------------------------------------------------*/
void drv_ds1302_set_time(unsigned char *time)
{
    unsigned char i;
    unsigned char ea_state;


    /* 保存当前中断状态 */
    ea_state = EA;

    /* 保护DS1302连续写入时序 */
    EA = 0;


    /*------------------------------------------------
     * 关闭写保护
     *------------------------------------------------*/
    drv_ds1302_write_byte(0x8E, 0x00);


    /*------------------------------------------------
     * 写入7个时间寄存器
     *
     * 秒、分、时、日、月、星期、年
     *------------------------------------------------*/
    for(i = 0; i < 7; i++)
    {
        drv_ds1302_write_byte(
            drv_ds1302_write_addr[i],
            time[i]
        );
    }


    /*------------------------------------------------
     * 重新开启写保护
     *------------------------------------------------*/
    drv_ds1302_write_byte(0x8E, 0x80);


    /* 恢复原来的中断状态 */
    EA = ea_state;
}