#include "hrtos.h"

/* =========================
 * LED
 * ========================= */
sbit LED_STACK = P1^0;

/* =========================================================
 * overflow hook（系统调用）
 * ========================================================= */
void overflow_handler(void)
{
    LED_STACK = 0;   /* 常亮报警 */
	
	while(1);
}

/* =========================================================
 * 故意制造栈压力
 * ========================================================= */
void deep_call(unsigned int n)
{
    SP = SP+n;
	os_delay(200);
}

/* =========================================================
 * 测试任务
 * ========================================================= */
void task_stack_demo(void)
{
    while(1)
    {
        

        deep_call(20);   /* 触发栈压力 */

        
    }
}

/* =========================================================
 * 入口
 * ========================================================= */
void hrtos_main(void)
{
    LED_STACK = 1;

    /* 注册 overflow hook */
    os_slab_overflow_register(overflow_handler);

    os_task_create((unsigned int)task_stack_demo, 1, 5, 1);
}