#include "hrtos.h"

/* =========================================================
 * LED
 * ========================================================= */
sbit LED_HIGH = P1^0;
sbit LED_LOW  = P1^1;
sbit LED_MID  = P1^2;

/* =========================================================
 * 资源锁（模拟mutex）
 * ========================================================= */
static u8 lock = 0;

/* =========================================================
 * 高优先级任务（被阻塞）
 * ========================================================= */
static void high_task(void)
{
    while(1)
    {
        LED_HIGH = ~LED_HIGH;

        /* 等待锁 */
        while(lock == 1)
        {
            os_delay(1);
        }

        os_delay(10);
    }
}

/* =========================================================
 * 低优先级任务（持锁）
 * ========================================================= */
static void low_task(void)
{
    while(1)
    {
        lock = 1;

        LED_LOW = ~LED_LOW;

        /* 模拟长临界区 */
        os_delay(50);

        lock = 0;

        os_delay(50);
    }
}

/* =========================================================
 * 中优先级任务（干扰调度）
 * ========================================================= */
static void mid_task(void)
{
    while(1)
    {
        LED_MID = ~LED_MID;

        /* CPU忙循环 */
        {
            volatile u16 i;
            for(i = 0; i < 2000; i++);
        }

        os_delay(20);
    }
}

/* =========================================================
 * 系统入口
 * ========================================================= */
void hrtos_main(void)
{
    LED_HIGH = 0;
    LED_LOW  = 0;
    LED_MID  = 0;

    lock = 0;

    /* =========================
     * 创建任务（关键：优先级结构）
     * ========================= */
    os_task_create((unsigned int)high_task, 1, 5, 5);  /* 高 */
    os_task_create((unsigned int)mid_task,  2, 3, 5);  /* 中 */
    os_task_create((unsigned int)low_task,  3, 1, 5);  /* 低 */

}