#include "hrtos.h"

/* =========================================================
 * LED
 * ========================================================= */
sbit LED_INT0 = P1^0;
sbit LED_INT1 = P1^1;
sbit LED_OK   = P1^2;

/* =========================================================
 * 状态标记
 * ========================================================= */
static volatile u8 mark = 0;
static volatile u8 pass = 0;

#define EVT_ID  0

/* =========================================================
 * INT0（高优先级）
 * ========================================================= */
static void int0_task(void)
{
    mark = 2;

    LED_INT0 = ~LED_INT0;

    os_event_set_from_isr(EVT_ID);

    os_interrupt_exit();
}

/* =========================================================
 * INT1（低优先级）
 * ========================================================= */
static void int1_task(void)
{
    mark = 1;

    LED_INT1 = ~LED_INT1;

    while(mark != 2)
    {
        ;
    }

    mark = 3;

    os_interrupt_exit();
}

/* =========================================================
 * 等待任务
 * ========================================================= */
static void event_task(void)
{
    os_event_wait(EVT_ID, 10);

    while(mark != 3)
    {
        ;
    }

    pass = 1;

    LED_OK = 1;

    os_task_exit();
}

/* =========================================================
 * 系统入口函数（必须）
 * ========================================================= */
void hrtos_main(void)
{
    /* 初始化状态 */
    mark = 0;
    pass = 0;

    LED_INT0 = 0;
    LED_INT1 = 0;
    LED_OK   = 0;

    /* 事件初始化 */
    os_event_init(EVT_ID);

    /* =========================
     * 注册任务
     * ========================= */
    os_task_create((unsigned int)event_task, 2, 3, 5);
    os_task_create((unsigned int)int1_task,  0, 9, 0);
    os_task_create((unsigned int)int0_task,  0, 10, 0);

    /* =========================
     * 中断配置
     * ========================= */
    IT0 = 1;
    IT1 = 1;

    IE0 = 0;
    IE1 = 0;

    EX0 = 1;
    EX1 = 1;

    PX0 = 1;   /* INT0 高优先级 */
    PX1 = 0;   /* INT1 低优先级 */

   
}