#include "hrtos_hal.h"


/*------------------------------------------------
 * 内部采样缓存
 *------------------------------------------------*/
unsigned int
ultrasonic_buffer[DRV_ULTRASONIC_SAMPLE_MAX];

/*------------------------------------------------
 * 超声波初始化
 *
 * Timer1：
 *     工作方式1
 *     16位定时器
 *------------------------------------------------*/
void drv_ultrasonic_init(void)
{
    /*
     * 设置Timer1为工作方式1
     *
     * TMOD高4位：
     *     0001
     */
    TMOD &= 0x0F;
    TMOD |= 0x10;


    /* Timer1初值清零 */
    TH1 = 0;
    TL1 = 0;


    /* 停止Timer1 */
    TR1 = 0;
}
