#include "hrtos_hal.h"



/*------------------------------------------------
 * 向DS1302写入一个字节
 *
 * addr：DS1302命令地址
 * _data：写入的数据
 *
 * DS1302采用低位优先方式传输。
 *
 * 注意：
 * 本函数属于严格时序操作，
 * 使用EA关闭总中断，防止通信被中断打断。
 *------------------------------------------------*/
void drv_ds1302_write_byte(unsigned char addr,
                           unsigned char _data)
{
    unsigned char i;
    unsigned char ea_state;


    /* 保存进入函数前的中断状态 */
    ea_state = EA;

    /* 关闭总中断，保护DS1302时序 */
    EA = 0;


    /*------------------------------------------------
     * 开始一次DS1302通信
     *------------------------------------------------*/
    DS1302_RST = 0;
    _nop_();

    DS1302_SCLK = 0;
    _nop_();

    DS1302_RST = 1;
    _nop_();


    /*------------------------------------------------
     * 发送8位地址命令
     *
     * DS1302低位优先传输。
     *------------------------------------------------*/
    for(i = 0; i < 8; i++)
    {
        DS1302_IO = (bit)(addr & 0x01);

        

        DS1302_SCLK = 1;
        _nop_();

        DS1302_SCLK = 0;
        addr >>= 1;
    }

	
	_nop_();
	_nop_();
    /*------------------------------------------------
     * 发送8位数据
     *
     * DS1302低位优先传输。
     *------------------------------------------------*/
    for(i = 0; i < 8; i++)
    {
        DS1302_IO = (bit)(_data & 0x01);

        

        DS1302_SCLK = 1;
        _nop_();

        DS1302_SCLK = 0;
        _data >>= 1;
    }


    /*------------------------------------------------
     * 结束本次通信
     *------------------------------------------------*/
	DS1302_SCLK=1;
     _nop_();
	
    DS1302_RST = 0;
    _nop_();


    /* 恢复进入函数之前的中断状态 */
    EA = ea_state;
}